/**
 * @file	constants.js
 * @date	2022.12.06
 * @author	yomile
 * @brief	상수 정의 파일
 */

export default
{
	//=======================================================================================
	// 타이머 
	//---------------------------------------------------------------------------------------	
	SCANNER_STOP_CHECK_TIMER_INTERVAL			: 30000,	// 로딩시간 체크 타이머 간격
	SCANNER_STOP_CHECK_TIME						: 30000,	// 로딩시간 체크시간, 밀리세컨드 
	//=======================================================================================

	//=======================================================================================
	// 스택액션 
	//---------------------------------------------------------------------------------------	
	STACK_ACTION_TARGET_WEBVIEW			: "SubMain",	// 스택액션이 있으면 서브메인 컨퍼넌트로 띄운다.
	//=======================================================================================


	//=======================================================================================
	// Native 메시지 구분
	//---------------------------------------------------------------------------------------
	MSG_REQUEST_PERMISSION			: "reqPerm",	// 퍼미션요청
	MSG_GO_MAIN						: "goMain",		// 메인화면으로 이동
	MSG_NEW_SCREEN					: "newScr",		// 새로운화면 오픈
	MSG_CLOSE_NEW_SCREEN			: "closeNewScr",// 새로운화면 닫기
	MSG_OPEN_URL					: "opnUrl",		// 새로운 URL 오픈
	MSG_TOAST						: "toast",		// 토스트메시지
	MSG_DOWNLOAD_URL				: "dnUrl",		// 다운로드URL 

	MSG_GET_SCAN_DATA				: "getScan",	// 스캔데이터 리턴
	MSG_GET_PUSH_DATA				: "getPush",	// 푸시데이터 리턴
	MSG_GET_APP_DATA				: "getApp",		// 앱 데이터 리턴
	MSG_SET_APP_DATA				: "setApp",		// 앱 데이터 설정
	
	MSG_SET_STATUS_BAR				: "setStBar",	// 상태바 설정
	MSG_GET_DEVICE_INFO				: "getDev",		// 디바이스 정보 리턴 요청 
	MSG_REQUEST_LOCATION 			: "reqLoc",		// 위치정보 요청
	MSG_SET_LOADING					: "setLoading",	// 로딩 설정
	MSG_SET_LOADING					: "setLoading",	// 로딩 설정
	MSG_SET_LOADING_ENABLED			: "setLoadEnable",	// 로딩 설정

	MSG_GET_MULTI_SCAN_DATA		: "getMultiScan",	// 멀티 스캔데이터 리턴

	//=======================================================================================

	//=======================================================================================
	// 상태바 스타일  
	//---------------------------------------------------------------------------------------
	STATUS_BAR_STYLE_DARK_CONTENT		: "dark-content",	// Dark
	STATUS_BAR_STYLE_LIGHT_CONTENT		: "light-content",	// Light
	//=======================================================================================

}